SiliconLabsSoftware/matter_sdk/src/platform/silabs/efr32/BLEManagerImpl.cpp
    responseData[index++] = static_cast<uint8_t>(mDeviceNameLength + 1); // length
    responseData[index++] = CHIP_ADV_DATA_TYPE_NAME;                     // AD type : name
    memcpy(&responseData[index], mDeviceName, mDeviceNameLength);        // AD value
    index += mDeviceNameLength;

    ret = sl_bt_legacy_advertiser_set_data(mAdvertisingSetHandle, sl_bt_advertiser_scan_response_packet, index,
                                           (uint8_t *) responseData);

    VerifyOrExit(ret == SL_STATUS_OK, {
        err = MapBLEError(ret);
        ChipLogError(DeviceLayer, "sl_bt_legacy_advertiser_set_data() - Scan Response failed: %" CHIP_ERROR_FORMAT, err.Format());
    });

    err = MapBLEError(ret);

exit:
    return err;
}

CHIP_ERROR BLEManagerImpl::StartAdvertising(void)
{
    CHIP_ERROR err          = CHIP_NO_ERROR;
    sl_status_t ret         = SL_STATUS_OK;
    uint32_t interval_min   = 0;
    uint32_t interval_max   = 0;
    bool postAdvChangeEvent = false;
    uint8_t connectableAdv =
        (NumConnections() < kMaxConnections) ? sl_bt_advertiser_connectable_scannable : sl_bt_advertiser_scannable_non_connectable;

    // If already advertising, stop it, before changing values
    if (mFlags.Has(Flags::kAdvertising))
    {
        sl_bt_advertiser_stop(mAdvertisingSetHandle);
    }
    else
    {
        ChipLogDetail(DeviceLayer, "Start BLE advertisement");
        postAdvChangeEvent = true;
    }

    err = ConfigureAdvertisingData();
    SuccessOrExit(err);

    mFlags.Clear(Flags::kRestartAdvertising);

    if (mFlags.Has(Flags::kFastAdvertisingEnabled))
    {
        interval_min = CHIP_DEVICE_CONFIG_BLE_FAST_ADVERTISING_INTERVAL_MIN;
        interval_max = CHIP_DEVICE_CONFIG_BLE_FAST_ADVERTISING_INTERVAL_MAX;
    }
    else
    {
#if CHIP_DEVICE_CONFIG_EXT_ADVERTISING
        if (!mFlags.Has(Flags::kExtAdvertisingEnabled))
        {
            interval_min = CHIP_DEVICE_CONFIG_BLE_SLOW_ADVERTISING_INTERVAL_MIN;
            interval_max = CHIP_DEVICE_CONFIG_BLE_SLOW_ADVERTISING_INTERVAL_MAX;
        }
        else
        {
            interval_min = CHIP_DEVICE_CONFIG_BLE_EXT_ADVERTISING_INTERVAL_MIN;
            interval_max = CHIP_DEVICE_CONFIG_BLE_EXT_ADVERTISING_INTERVAL_MAX;
        }
#else
        interval_min = CHIP_DEVICE_CONFIG_BLE_SLOW_ADVERTISING_INTERVAL_MIN;
        interval_max = CHIP_DEVICE_CONFIG_BLE_SLOW_ADVERTISING_INTERVAL_MAX;
#endif
    }

    ChipLogProgress(DeviceLayer, "Starting advertising with interval_min=%u, intverval_max=%u (units of 625us)",
                    static_cast<unsigned>(interval_min), static_cast<unsigned>(interval_max));
    ret = sl_bt_advertiser_set_timing(mAdvertisingSetHandle, interval_min, interval_max, 0, 0);
    err = MapBLEError(ret);
    SuccessOrExit(err);

    sl_bt_advertiser_configure(mAdvertisingSetHandle, 1);

    ret = sl_bt_legacy_advertiser_start(mAdvertisingSetHandle, connectableAdv);
    err = MapBLEError(ret);
    SuccessOrExit(err);

    if (mFlags.Has(Flags::kFastAdvertisingEnabled))
    {
        StartBleAdvTimeoutTimer(CHIP_DEVICE_CONFIG_BLE_ADVERTISING_INTERVAL_CHANGE_TIME);
    }
    mFlags.Set(Flags::kAdvertising);

    if (postAdvChangeEvent)
    {
        // Post CHIPoBLEAdvertisingChange event.
        ChipDeviceEvent advChange;
        advChange.Type                             = DeviceEventType::kCHIPoBLEAdvertisingChange;
        advChange.CHIPoBLEAdvertisingChange.Result = kActivity_Started;

        ReturnErrorOnFailure(PlatformMgr().PostEvent(&advChange));
    }

exit:
    return err;
}

CHIP_ERROR BLEManagerImpl::StopAdvertising(void)
{
    CHIP_ERROR err = CHIP_NO_ERROR;

    if (mFlags.Has(Flags::kAdvertising))
    {
        sl_status_t ret = SL_STATUS_OK;

        mFlags.Clear(Flags::kAdvertising).Clear(Flags::kRestartAdvertising);
        mFlags.Set(Flags::kFastAdvertisingEnabled, true);

        ret = sl_bt_advertiser_stop(mAdvertisingSetHandle);
        sl_bt_advertiser_clear_random_address(mAdvertisingSetHandle);

        sl_bt_advertiser_delete_set(mAdvertisingSetHandle);
        mAdvertisingSetHandle = kInvalidAdvertisingHandle;
        err                   = MapBLEError(ret);
        VerifyOrReturnError(err == CHIP_NO_ERROR, err);

        CancelBleAdvTimeoutTimer();

        // Post CHIPoBLEAdvertisingChange event.
        ChipDeviceEvent advChange;
        advChange.Type                             = DeviceEventType::kCHIPoBLEAdvertisingChange;
        advChange.CHIPoBLEAdvertisingChange.Result = kActivity_Stopped;
        err                                        = PlatformMgr().PostEvent(&advChange);
    }

    return err;
}
#if defined(SL_BLE_SIDE_CHANNEL_ENABLED) && SL_BLE_SIDE_CHANNEL_ENABLED

CHIP_ERROR BLEManagerImpl::SideChannelConfigureAdvertisingDefaultData(void)
{
    VerifyOrReturnError(mBleSideChannel != nullptr, CHIP_ERROR_INCORRECT_STATE);

    uint8_t advData[MAX_ADV_DATA_LEN];
    uint32_t index = 0;

    // Flags
    advData[index++] = 2;                        // Length
    advData[index++] = CHIP_ADV_DATA_TYPE_FLAGS; // Flags AD Type
    advData[index++] = 0x06;                     // LE General Discoverable Mode, BR/EDR not supported

    // Service UUID
    advData[index++] = 3;                       // Length
    advData[index++] = CHIP_ADV_DATA_TYPE_UUID; // 16-bit UUID
    advData[index++] = 0x34;                    // UUID 0x1234 (little endian)
    advData[index++] = 0x12;
    ByteSpan advDataSpan(advData, index);

    uint8_t responseData[MAX_RESPONSE_DATA_LEN];
    index = 0;

    const char * sideChannelName = "Si-Channel";
    size_t sideChannelNameLen    = strlen(sideChannelName);

    responseData[index++] = static_cast<uint8_t>(sideChannelNameLen + 1);
    responseData[index++] = 0x09; // Complete Local Name
    memcpy(&responseData[index], sideChannelName, sideChannelNameLen);
    index += sideChannelNameLen;
    ByteSpan responseDataSpan(responseData, index);

    AdvConfigStruct config = { advDataSpan,
                               responseDataSpan,
                               BLE_CONFIG_MIN_INTERVAL_SC,
                               BLE_CONFIG_MAX_INTERVAL_SC,
                               sl_bt_advertiser_connectable_scannable,
                               0,
                               0 };
    return mBleSideChannel->ConfigureAdvertising(config);
}

