SiliconLabsSoftware/matter_sdk/src/platform/silabs/efr32/BLEManagerImpl.cpp
CHIP_ERROR BLEManagerImpl::InjectSideChannel(BLEChannel * channel)
{
    VerifyOrReturnError(nullptr != channel, CHIP_ERROR_INVALID_ARGUMENT);
    mBleSideChannel = channel;
    return CHIP_NO_ERROR;
}

CHIP_ERROR BLEManagerImpl::SideChannelConfigureAdvertising(ByteSpan advData, ByteSpan responseData, uint32_t intervalMin,
                                                           uint32_t intervalMax, uint16_t duration, uint8_t maxEvents)
{
    VerifyOrReturnError(mBleSideChannel != nullptr, CHIP_ERROR_INCORRECT_STATE);
    AdvConfigStruct config = { advData,  responseData, intervalMin, intervalMax, sl_bt_advertiser_connectable_scannable,
                               duration, maxEvents };
    return mBleSideChannel->ConfigureAdvertising(config);
}

CHIP_ERROR BLEManagerImpl::SideChannelStartAdvertising(void)
{
    VerifyOrReturnError(mBleSideChannel != nullptr, CHIP_ERROR_INCORRECT_STATE);
    return mBleSideChannel->StartAdvertising();
}

CHIP_ERROR BLEManagerImpl::SideChannelStopAdvertising(void)
{
    VerifyOrReturnError(mBleSideChannel != nullptr, CHIP_ERROR_INCORRECT_STATE);
    return mBleSideChannel->StopAdvertising();
}

void BLEManagerImpl::HandleReadEvent(volatile sl_bt_msg_t * evt)
{
    if (GetConnectionState(evt->data.evt_gatt_server_user_read_request.connection) ||
        isMATTERoBLECharacteristic(evt->data.evt_gatt_server_user_read_request.characteristic))
    {
        // Sends invalid handle if the user attemps to read a value other than C3 on CHIPoBLE
        // or if the user attempts to read a CHIPoBLE characteristic on the side channel
        sl_bt_gatt_server_send_user_read_response(evt->data.evt_gatt_server_user_read_request.connection,
                                                  evt->data.evt_gatt_server_user_read_request.characteristic, 0x01, 0, 0, nullptr);
        return;
    }
    else if (mBleSideChannel != nullptr)
    {
        // Side channel read request
        ChipLogProgress(DeviceLayer, "Char Read Req, char : %d", evt->data.evt_gatt_server_user_read_request.characteristic);

        char dataBuff[] = "You are reading the Si-Channel TX characteristic";
        ByteSpan dataSpan((const uint8_t *) dataBuff, sizeof(dataBuff));
        mBleSideChannel->HandleReadRequest(evt, dataSpan);
    }
}
#endif // defined(SL_BLE_SIDE_CHANNEL_ENABLED) && SL_BLE_SIDE_CHANNEL_ENABLED

void BLEManagerImpl::UpdateMtu(volatile sl_bt_msg_t * evt)
{
    BLEConState * bleConnState = GetConnectionState(evt->data.evt_gatt_mtu_exchanged.connection);
    if (bleConnState != NULL)
    {
        // bleConnState->MTU is a 10-bit field inside a uint16_t.  We're
        // assigning to it from a uint16_t, and compilers warn about
        // possibly not fitting.  There's no way to suppress that warning
        // via explicit cast; we have to disable the warning around the
        // assignment.
        //
        // TODO: https://github.com/project-chip/connectedhomeip/issues/2569
        // tracks making this safe with a check or explaining why no check
        // is needed.
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wconversion"
        bleConnState->mtu = evt->data.evt_gatt_mtu_exchanged.mtu;
#pragma GCC diagnostic pop
        ;
    }
    else if (mBleSideChannel != nullptr)
    {
        mBleSideChannel->UpdateMtu(evt);
    }
}

void BLEManagerImpl::HandleConnectEvent(volatile sl_bt_msg_t * evt)
{

    sl_bt_evt_connection_opened_t * conn_evt = (sl_bt_evt_connection_opened_t *) &(evt->data);

    if (conn_evt->advertiser == mAdvertisingSetHandle)
    {
        ChipLogProgress(DeviceLayer, "Connect Event for CHIPoBLE on handle : %d", conn_evt->connection);

        AddConnection(conn_evt->connection, conn_evt->bonding);
        PlatformMgr().ScheduleWork(DriveBLEState, 0);
    }
    else if (mBleSideChannel != nullptr)
    {
        // We assumed we are using the side channel from the moment we
        // are not using the CHIPoBLE service.
        ChipLogProgress(DeviceLayer, "Connect Event for SideChannel on handle : %d", conn_evt->connection);
        mBleSideChannel->AddConnection(conn_evt->connection, conn_evt->bonding);
        return;
    }
}

void BLEManagerImpl::HandleConnectParams(volatile sl_bt_msg_t * evt)
{
    sl_bt_evt_connection_parameters_t * con_param_evt = (sl_bt_evt_connection_parameters_t *) &(evt->data);

    // If the connection belongs to the CHIPoBLE service

    ChipLogProgress(DeviceLayer, "Connection Parameters Event for handle : %d", con_param_evt->connection);
    ChipLogProgress(DeviceLayer, "Interval: %d, Latency: %d, Timeout: %d", con_param_evt->interval, con_param_evt->latency,
                    con_param_evt->timeout);

    uint16_t desiredTimeout = con_param_evt->timeout < BLE_CONFIG_TIMEOUT ? BLE_CONFIG_TIMEOUT : con_param_evt->timeout;

    // For better stability, renegotiate the connection parameters if the received ones from the central are outside
    // of our defined constraints
    if (desiredTimeout != con_param_evt->timeout || con_param_evt->interval < BLE_CONFIG_MIN_INTERVAL ||
        con_param_evt->interval > BLE_CONFIG_MAX_INTERVAL)
    {
        ChipLogProgress(DeviceLayer, "Renegotiate BLE connection parameters to minInterval:%d, maxInterval:%d, timeout:%d",
                        BLE_CONFIG_MIN_INTERVAL, BLE_CONFIG_MAX_INTERVAL, desiredTimeout);
        sl_bt_connection_set_parameters(con_param_evt->connection, BLE_CONFIG_MIN_INTERVAL, BLE_CONFIG_MAX_INTERVAL,
                                        BLE_CONFIG_LATENCY, desiredTimeout, BLE_CONFIG_MIN_CE_LENGTH, BLE_CONFIG_MAX_CE_LENGTH);
    }

    if (nullptr != GetConnectionState(con_param_evt->connection, false))
    {
        PlatformMgr().ScheduleWork(DriveBLEState, 0);
    }
}

void BLEManagerImpl::HandleConnectionCloseEvent(volatile sl_bt_msg_t * evt)
{
    sl_bt_evt_connection_closed_t * conn_evt = (sl_bt_evt_connection_closed_t *) &(evt->data);

    if (nullptr != GetConnectionState(conn_evt->connection, false))
    {
        ChipLogProgress(DeviceLayer, "Disconnect Event for CHIPoBLE on handle : %d", conn_evt->connection);
        if (RemoveConnection(conn_evt->connection))
        {
            ChipDeviceEvent event;
            event.Type                          = DeviceEventType::kCHIPoBLEConnectionError;
            event.CHIPoBLEConnectionError.ConId = conn_evt->connection;

            switch (conn_evt->reason)
            {
            case SL_STATUS_BT_CTRL_REMOTE_USER_TERMINATED:
            case SL_STATUS_BT_CTRL_REMOTE_DEVICE_TERMINATED_CONNECTION_DUE_TO_LOW_RESOURCES:
            case SL_STATUS_BT_CTRL_REMOTE_POWERING_OFF:
                event.CHIPoBLEConnectionError.Reason = BLE_ERROR_REMOTE_DEVICE_DISCONNECTED;
                break;

            case SL_STATUS_BT_CTRL_CONNECTION_TERMINATED_BY_LOCAL_HOST:
                event.CHIPoBLEConnectionError.Reason = BLE_ERROR_APP_CLOSED_CONNECTION;
                break;

            default:
                event.CHIPoBLEConnectionError.Reason = BLE_ERROR_CHIPOBLE_PROTOCOL_ABORT;
                break;
            }

